000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КафкаИсходящиеСообщения/КафкаИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КафкаИсходящиеСообщения</name>
  <resources>
    <name>СсылкаДляВыгрузки</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <resources>
    <name>ОтборДляВыгрузки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПолноеНаименованиеОбъектаВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусВыгрузки</name>
    <type>
      <types>EnumRef.КафкаСтатус</types>
    </type>
  </resources>
  <resources>
    <name>ХешДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВремяСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Топик</name>
    <type>
      <types>CatalogRef.КафкаТопики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/КафкаСтатус/КафкаСтатус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КафкаСтатус</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаПродюсеры/КафкаПродюсеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаПродюсеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАсинх</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПакетнуюПубликацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсьюмерПроверки</name>
    <type>
      <types>CatalogRef.КафкаКонсьюмеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыПродюсера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>CatalogRef.КафкаТопики</types>
      </type>
    </attributes>
    <attributes>
      <name>Порция</name>
      <comment>Количество сообщений для отправки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаТопики/КафкаТопики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаТопики</name>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Партиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаКонсьюмеры/КафкаКонсьюмеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаКонсьюмеры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Брокер</name>
    <type>
      <types>CatalogRef.КафкаБрокеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДвоичныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУзла</name>
    <type>
      <types>EnumRef.ВидыУзлов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>CatalogRef.КафкаТопики</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотоков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыКонсьюмера</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КафкаНастройки/КафкаНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КафкаНастройки</name>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Топики</name>
    <attributes>
      <name>Топик</name>
      <type>
        <types>CatalogRef.КафкаТопики</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапросНаПолучателей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ШинаОбмен/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает фоновые задания для выполнения обмена данными через шину в указанном направлении при отправке.
//
// Параметры:
//   Брокер - Строка - наименование брокера
//   НаправлениеОбмена - Строка - направление обмена данными
Процедура ШинаДанных(Брокер, НаправлениеОбмена) Экспорт
	
	Если ВРег(НаправлениеОбмена) = ВРег("Отправка") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КафкаПродюсеры.Ссылка КАК Продюсер,
			|	КафкаПродюсерыТопики.Топик КАК Топик,
			|	КафкаПродюсерыТопики.Порция КАК Порция,
			|	КафкаТопики.Партиции КАК Партиции,
			|	КафкаТопики.Наименование КАК ИмяТопика,
			|	КафкаПродюсеры.Наименование КАК НаименованиеПродюсера
			|ИЗ
			|	Справочник.КафкаПродюсеры.Топики КАК КафкаПродюсерыТопики
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаПродюсеры КАК КафкаПродюсеры
			|		ПО КафкаПродюсерыТопики.Ссылка = КафкаПродюсеры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
			|		ПО КафкаПродюсерыТопики.Топик = КафкаТопики.Ссылка
			|ГДЕ
			|	НЕ КафкаПродюсеры.ПометкаУдаления
			|	И КафкаПродюсеры.Брокер = &Брокер
			|	И НЕ КафкаТопики.ПометкаУдаления
			|	И КафкаТопики.Брокер = &Брокер";
		
		Запрос.УстановитьПараметр("Брокер", Справочники.КафкаБрокеры.НайтиПоНаименованию(Брокер));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для НомерПотока = 1 По Выборка.Партиции Цикл

				НаименованиеОтправки = СтрШаблон("ПотокОтправки_%1_%2"
					, СокрЛП(Выборка.НаименованиеПродюсера)
					, НомерПотока);				
				Отбор = Новый Структура("Наименование", НаименованиеОтправки);
				ФоновыеЗаданияПотока = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
				
				ЗаданиеСуществует = Ложь;
				Для Каждого ФоновоеЗадание Из ФоновыеЗаданияПотока Цикл
					Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
						ЗаданиеСуществует = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗаданиеСуществует Тогда
					
					ДанныеЗадания = Новый Структура;
					ДанныеЗадания.Вставить("Топик", Выборка.Топик);
					ДанныеЗадания.Вставить("ИмяТопика", Выборка.ИмяТопика);
					ДанныеЗадания.Вставить("Продюсер", Выборка.Продюсер);
					ДанныеЗадания.Вставить("НомерПотока", НомерПотока);
					ДанныеЗадания.Вставить("Порция", Выборка.Порция);
					ПараметрыЗадания = Новый Массив;
					ПараметрыЗадания.Добавить(ДанныеЗадания);
					
					ФоновыеЗадания.Выполнить(
						"ШинаОбмен.ЗаданиеВыполнитьОбменОтправка",
						ПараметрыЗадания,
						НаименованиеОтправки,
						НаименованиеОтправки);
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КафкаКонсьюмеры.Ссылка КАК Консьюмер,
			|	КафкаКонсьюмерыТопики.Топик КАК Топик,
			|	КафкаТопики.Партиции КАК Партиции,
			|	КафкаТопики.Наименование КАК ИмяТопика,
			|	КафкаКонсьюмеры.Наименование КАК НаименованиеКонсьюмера
			|ИЗ
			|	Справочник.КафкаКонсьюмеры.Топики КАК КафкаКонсьюмерыТопики
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаКонсьюмеры КАК КафкаКонсьюмеры
			|		ПО КафкаКонсьюмерыТопики.Ссылка = КафкаКонсьюмеры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
			|		ПО КафкаКонсьюмерыТопики.Топик = КафкаТопики.Ссылка
			|ГДЕ
			|	НЕ КафкаКонсьюмеры.ПометкаУдаления
			|	И КафкаКонсьюмеры.Брокер = &Брокер
			|	И НЕ КафкаТопики.ПометкаУдаления
			|	И КафкаТопики.Брокер = &Брокер";
		
		Запрос.УстановитьПараметр("Брокер", Справочники.КафкаБрокеры.НайтиПоНаименованию(Брокер));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для НомерПотока = 1 По Выборка.Партиции Цикл

				НаименованиеОтправки = СтрШаблон("ПотокПолучения_%1_%2"
					, СокрЛП(Выборка.НаименованиеКонсьюмера)
					, НомерПотока);
				
				Отбор = Новый Структура("Наименование", НаименованиеОтправки);
				ФоновыеЗаданияПотока = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
				
				ЗаданиеСуществует = Ложь;
				Для Каждого ФоновоеЗадание Из ФоновыеЗаданияПотока Цикл
					Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
						ЗаданиеСуществует = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗаданиеСуществует Тогда

					ПараметрыЗадания = Новый Массив;
					ПараметрыЗадания.Добавить(Выборка.Консьюмер);
					
					ФоновыеЗадания.Выполнить(
						"ШинаОбмен.ЗаданиеВыполнитьОбменПолучение",
						ПараметрыЗадания,
						НаименованиеОтправки,
						НаименованиеОтправки);
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет отправку сообщений из регистра сведений в Kafka через поток продюсера в бесконечном цикле. 
// Обрабатывает сообщения с статусом "Новый", обновляет статус на "Выгружен" или "Ошибка".
//
// Параметры:
//   ДанныеЗадания - Структура:
//     * Порция - Число - количество сообщений, обрабатываемых за одну итерацию
//     * НомерПотока - Число - номер потока для отбора сообщений в регистре
//     * Топик - Строка - наименование топика Kafka для отбора сообщений
//     * Продюсер - СправочникСсылка.КафкаПродюсеры - объект продюсера Kafka
//     * ИмяТопика - Строка - наименование топика для отправки сообщений
Процедура ЗаданиеВыполнитьОбменОтправка(ДанныеЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ПустыхВыполнений = 0;

	Сессии = Новый Соответствие();

	Пока Истина Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КафкаИсходящиеСообщения.ВремяСоздания КАК ВремяСоздания,
			|	КафкаИсходящиеСообщения.УникальныйИдентификатор КАК УникальныйИдентификатор,
			|	КафкаИсходящиеСообщения.НомерПотока КАК НомерПотока,
			|	КафкаИсходящиеСообщения.СсылкаДляВыгрузки КАК СсылкаДляВыгрузки,
			|	КафкаИсходящиеСообщения.ОтборДляВыгрузки КАК ОтборДляВыгрузки,
			|	КафкаИсходящиеСообщения.ПолноеНаименованиеОбъектаВыгрузки КАК ПолноеНаименованиеОбъектаВыгрузки,
			|	КафкаИсходящиеСообщения.ДанныеВыгрузки КАК ДанныеВыгрузки,
			|	КафкаИсходящиеСообщения.СтатусВыгрузки КАК СтатусВыгрузки,
			|	КафкаИсходящиеСообщения.Топик КАК Топик,
			|	КафкаИсходящиеСообщения.ХешДанных КАК ХешДанных,
			|	КафкаИсходящиеСообщения.Получатели КАК Получатели
			|ИЗ
			|	РегистрСведений.КафкаИсходящиеСообщения КАК КафкаИсходящиеСообщения
			|ГДЕ
			|	КафкаИсходящиеСообщения.НомерПотока = &НомерПотока
			|	И КафкаИсходящиеСообщения.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.КафкаСтатус.Новый)
			|	И КафкаИсходящиеСообщения.Топик = &Топик
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВремяСоздания";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(ДанныеЗадания.Порция, "ЧГ=0;"));

		Запрос.УстановитьПараметр("НомерПотока", ДанныеЗадания.НомерПотока);
		Запрос.УстановитьПараметр("Топик", ДанныеЗадания.Топик);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			ПустыхВыполнений = ПустыхВыполнений + 1;
		Иначе
			ПустыхВыполнений = 0;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗаписи = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
			
			Сообщение = КафкаИнтеграция.ПараметрыСообщения(Выборка.ДанныеВыгрузки
				, Строка(Выборка.УникальныйИдентификатор));

			РезультатОтправки = КафкаИнтеграцияСлужебный.Отправить(ДанныеЗадания.Продюсер
				, ДанныеЗадания.ИмяТопика
				, Сообщение
				, ДанныеЗадания.НомерПотока - 1
				, Сессии);
				
			Если РезультатОтправки.Успешно Тогда
				
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Выгружен;
				
			Иначе
				
				СтруктураЗаписи.ТекстОшибки = РезультатОтправки.ТекстОшибки;
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Ошибка;
				
			КонецЕсли;
			
			РегистрыСведений.КафкаИсходящиеСообщения.ЗаписатьИзменениеСтатуса(СтруктураЗаписи);

		КонецЦикла;

		Если ПустыхВыполнений >= 5 Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;
	
	КафкаИнтеграцияСлужебный.ЗакрытьСессииПродюсера(Сессии);

КонецПроцедуры

// Выполняет загрузку входящих сообщений через консьюмеры в параллельном потоке.
//
// Параметры:
//   Консьюмер - СправочникСсылка.КафкаКонсьюмеры - консьюмер для загрузки сообщений
Процедура ЗаданиеВыполнитьОбменПолучение(Консьюмер) Экспорт

	Сессии = Новый Соответствие;

	БлокироватьЗавершенияДо = ТекущаяУниверсальнаяДата() + 60; // первую минуту блокируем завершение

	Пока БлокироватьЗавершенияДо > ТекущаяУниверсальнаяДата() Цикл
		Загружено = Ложь;
		КафкаИнтеграцияСлужебный.ОбработчикЗагрузкиСообщений(Консьюмер, Сессии, Загружено);
		Если Загружено Тогда
			БлокироватьЗавершенияДо = ТекущаяУниверсальнаяДата() + 60; // ототдвегаем закрытие на минуту
		КонецЕсли;;

	КонецЦикла;
	
	КафкаИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоШинеЗарегистрироватьИзменениеПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеДокументаПриЗаписи(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеКонстантыПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзмененияДанных(Источник, Объект = Истина)
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяИсточника = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КафкаНастройки.Ссылка КАК Ссылка,
		|	КафкаНастройкиТопики.Топик КАК Топик,
		|	КафкаТопики.Партиции КАК Партиции,
		|	КафкаНастройкиТопики.ЗапросНаПолучателей КАК ЗапросНаПолучателей
		|ИЗ
		|	Справочник.КафкаНастройки.Топики КАК КафкаНастройкиТопики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаНастройки КАК КафкаНастройки
		|		ПО КафкаНастройкиТопики.Ссылка = КафкаНастройки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
		|		ПО КафкаНастройкиТопики.Топик = КафкаТопики.Ссылка
		|ГДЕ
		|	КафкаНастройки.Наименование = &Наименование
		|	И НЕ КафкаТопики.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ПолноеИмяИсточника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		КоличествоПотоков = Выборка.Партиции;
		
		Если КоличествоПотоков = 0 Тогда
			Возврат;
		КонецЕсли;

		ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
		НомерПотока = ГСЧ.СлучайноеЧисло(1, КоличествоПотоков);

		Если Объект Тогда

			ОтборДляВыгрузкиХранилище = "";
			СсылкаНаОбъект = Источник.Ссылка;
			УникальныйИдентификатор = Строка(СсылкаНаОбъект.УникальныйИдентификатор());
			
			Если Не ПустаяСтрока(Выборка.ЗапросНаПолучателей) Тогда
				
				МассивПолучателей = Новый Массив;
				ЗапросНаПолучателей = Новый Запрос(Выборка.ЗапросНаПолучателей);
				ЗапросНаПолучателей.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
				РезультатЗапросаНаПолучателей = ЗапросНаПолучателей.Выполнить();
				ВыборкаНаПолучателей = РезультатЗапросаНаПолучателей.Выбрать();
				Пока ВыборкаНаПолучателей.Следующий() Цикл
					МассивПолучателей.Добавить(ВыборкаНаПолучателей.Получатель);
				КонецЦикла;
				
				СтрокаПолучателей = СтрСоединить(МассивПолучателей, ",");
				
			КонецЕсли;

		Иначе
			
			СсылкаНаОбъект = Неопределено;
			ОтборДляВыгрузки = Новый Структура;
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				ОтборДляВыгрузки.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
			КонецЦикла;
			ОтборДляВыгрузкиХранилище = Новый ХранилищеЗначения(ОтборДляВыгрузки, Новый СжатиеДанных(9));
			УникальныйИдентификатор = "";
			СтрокаПолучателей = "";

		КонецЕсли;
		
		ИсходящиеДанные = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
		ИсходящиеДанные.УникальныйИдентификатор = УникальныйИдентификатор;
		ИсходящиеДанные.ВремяСоздания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИсходящиеДанные.НомерПотока = НомерПотока;
		ИсходящиеДанные.Топик = Выборка.Топик;
		ИсходящиеДанные.СсылкаДляВыгрузки = СсылкаНаОбъект;
		ИсходящиеДанные.ОтборДляВыгрузки = ОтборДляВыгрузкиХранилище;
		ИсходящиеДанные.ПолноеНаименованиеОбъектаВыгрузки = ПолноеИмяИсточника;
		ИсходящиеДанные.СтатусВыгрузки = Перечисления.КафкаСтатус.Новый;
		ИсходящиеДанные.Получатели = СтрокаПолучателей;
		КафкаИнтеграция.ПодготовитьСообщение(Источник, ИсходящиеДанные);
		РегистрыСведений.КафкаИсходящиеСообщения.ДобавитьЗаписьРегистра(ИсходящиеДанные);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
